Revit 2026 API

# SaveOptions Constructor

---

Default constructor.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SaveOptions()
```
```vb
Public Sub New
```
```cpp
public:
SaveOptions()
```
```fsharp
new : unit -> SaveOptions
```

PreviewViewId will be InvalidElementId.

#### Reference

SaveOptions Class

Autodesk.Revit.DB Namespace